Revit 2024 API
AreaReinforcement.MoveLine Method
 This method applies the translation to the line from the desired layer, at the specified position. If the line was already moved, the method will concatenate the translation with the existing movement. The line will be translated only along the direction of the specified layer.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public void MoveLine(
	XYZ translation,
	AreaReinforcementLayerType layer,
	int linePositionIndex
)
Visual Basic
Public Sub MoveLine ( _
	translation As XYZ, _
	layer As AreaReinforcementLayerType, _
	linePositionIndex As Integer _
)
Visual C++
public:
void MoveLine(
	XYZ^ translation,
	AreaReinforcementLayerType layer,
	int linePositionIndex
)
Parameters
translation
Type: Autodesk.Revit.DB.XYZ
 The translation vector.
layer
Type: Autodesk.Revit.DB.Structure.AreaReinforcementLayerType
 The layer on which the line stays.
linePositionIndex
Type: System.Int32
 The index of the line from the desired layer. It should be an index between 0 and (NumberOfLines-1).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  linePositionIndex is not in the range [ 0, NumberOfLines-1 ]. -or- A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.InapplicableDataException |  The layer layer isn't active.
Autodesk.Revit.Exceptions.InvalidOperationException |  This AreaReinforcement does not host Rebar.
See Also
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace